/*********************************************************************************************************************
<<<<<<< HEAD
* TC377 Opensourec Library ï¿½ï¿½ï¿½ï¿½TC377 ï¿½ï¿½Ô´ï¿½â£©ï¿½ï¿½Ò»ï¿½ï¿½ï¿½ï¿½ï¿½Ú¹Ù·ï¿½ SDK ï¿½Ó¿ÚµÄµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ô´ï¿½ï¿½
* Copyright (c) 2022 SEEKFREE ï¿½ï¿½É¿Æ¼ï¿½
*
* ï¿½ï¿½ï¿½Ä¼ï¿½ï¿½ï¿½ TC377 ï¿½ï¿½Ô´ï¿½ï¿½ï¿½Ò»ï¿½ï¿½ï¿½ï¿½
*
* TC377 ï¿½ï¿½Ô´ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
* ï¿½ï¿½ï¿½ï¿½ï¿½Ô¸ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½á·¢ï¿½ï¿½ï¿½ï¿½ GPLï¿½ï¿½GNU General Public Licenseï¿½ï¿½ï¿½ï¿½ GNUÍ¨ï¿½Ã¹ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ö¤ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
* ï¿½ï¿½ GPL ï¿½Äµï¿½3ï¿½æ£¨ï¿½ï¿½ GPL3.0ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ñ¡ï¿½ï¿½Ä£ï¿½ï¿½ÎºÎºï¿½ï¿½ï¿½ï¿½Ä°æ±¾ï¿½ï¿½ï¿½ï¿½ï¿½Â·ï¿½ï¿½ï¿½ï¿½ï¿½/ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½
*
* ï¿½ï¿½ï¿½ï¿½Ô´ï¿½ï¿½Ä·ï¿½ï¿½ï¿½ï¿½ï¿½Ï£ï¿½ï¿½ï¿½ï¿½ï¿½Ü·ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ã£ï¿½ï¿½ï¿½ï¿½ï¿½Î´ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ÎºÎµÄ±ï¿½Ö¤
* ï¿½ï¿½ï¿½ï¿½Ã»ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ô»ï¿½ï¿½Êºï¿½ï¿½Ø¶ï¿½ï¿½ï¿½Í¾ï¿½Ä±ï¿½Ö¤
* ï¿½ï¿½ï¿½ï¿½Ï¸ï¿½ï¿½ï¿½ï¿½Î¼ï¿½ GPL
*
* ï¿½ï¿½Ó¦ï¿½ï¿½ï¿½ï¿½ï¿½Õµï¿½ï¿½ï¿½ï¿½ï¿½Ô´ï¿½ï¿½ï¿½Í¬Ê±ï¿½Õµï¿½Ò»ï¿½ï¿½ GPL ï¿½Ä¸ï¿½ï¿½ï¿½
* ï¿½ï¿½ï¿½Ã»ï¿½Ð£ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½<https://www.gnu.org/licenses/>
*
* ï¿½ï¿½ï¿½ï¿½×¢ï¿½ï¿½ï¿½ï¿½
* ï¿½ï¿½ï¿½ï¿½Ô´ï¿½ï¿½Ê¹ï¿½ï¿½ GPL3.0 ï¿½ï¿½Ô´ï¿½ï¿½ï¿½ï¿½Ö¤Ð­ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Îªï¿½ï¿½ï¿½Ä°æ±¾
* ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ó¢ï¿½Ä°ï¿½ï¿½ï¿½ libraries/doc ï¿½Ä¼ï¿½ï¿½ï¿½ï¿½Âµï¿½ GPL3_permission_statement.txt ï¿½Ä¼ï¿½ï¿½ï¿½
* ï¿½ï¿½ï¿½ï¿½Ö¤ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ libraries ï¿½Ä¼ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½Ä¼ï¿½ï¿½ï¿½ï¿½Âµï¿½ LICENSE ï¿½Ä¼ï¿½
* ï¿½ï¿½Ó­ï¿½ï¿½Î»Ê¹ï¿½Ã²ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½ï¿½ï¿½Ê±ï¿½ï¿½ï¿½ë±£ï¿½ï¿½ï¿½ï¿½É¿Æ¼ï¿½ï¿½Ä°ï¿½È¨ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
*
* ï¿½Ä¼ï¿½ï¿½ï¿½ï¿½ï¿½          zf_device_absolute_encoder
* ï¿½ï¿½Ë¾ï¿½ï¿½ï¿½ï¿½          ï¿½É¶ï¿½ï¿½ï¿½É¿Æ¼ï¿½ï¿½ï¿½ï¿½Þ¹ï¿½Ë¾
* ï¿½æ±¾ï¿½ï¿½Ï¢          ï¿½é¿´ libraries/doc ï¿½Ä¼ï¿½ï¿½ï¿½ï¿½ï¿½ version ï¿½Ä¼ï¿½ ï¿½æ±¾Ëµï¿½ï¿½
* ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½          ADS v1.10.2
* ï¿½ï¿½ï¿½ï¿½Æ½Ì¨          TC377TP
* ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½          https://seekfree.taobao.com/
*
* ï¿½Þ¸Ä¼ï¿½Â¼
* ï¿½ï¿½ï¿½ï¿½              ï¿½ï¿½ï¿½ï¿½                ï¿½ï¿½×¢
* 2022-11-03       pudding           first version
* 2023-04-25       pudding           ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½×¢ï¿½ï¿½Ëµï¿½ï¿½
********************************************************************************************************************/
/*********************************************************************************************************************
* ï¿½ï¿½ï¿½ß¶ï¿½ï¿½å£º
*                   ------------------------------------
*                   Ä£ï¿½ï¿½Ü½ï¿½            ï¿½ï¿½Æ¬ï¿½ï¿½ï¿½Ü½ï¿½
*                   SCLK               ï¿½é¿´ zf_device_absolute_encoder.h ï¿½ï¿½ ABSOLUTE_ENCODER_SCLK_PIN ï¿½ê¶¨ï¿½ï¿½
*                   MOSI               ï¿½é¿´ zf_device_absolute_encoder.h ï¿½ï¿½ ABSOLUTE_ENCODER_MOSI_PIN ï¿½ê¶¨ï¿½ï¿½
*                   MISO               ï¿½é¿´ zf_device_absolute_encoder.h ï¿½ï¿½ ABSOLUTE_ENCODER_MISO_PIN ï¿½ê¶¨ï¿½ï¿½
*                   CS                 ï¿½é¿´ zf_device_absolute_encoder.h ï¿½ï¿½ ABSOLUTE_ENCODER_CS_PIN ï¿½ê¶¨ï¿½ï¿½
*                   VCC                3.3Vï¿½ï¿½Ô´
*                   GND                ï¿½ï¿½Ô´ï¿½ï¿½
=======
* TC377 Opensourec Library ¼´£¨TC377 ¿ªÔ´¿â£©ÊÇÒ»¸ö»ùÓÚ¹Ù·½ SDK ½Ó¿ÚµÄµÚÈý·½¿ªÔ´¿â
* Copyright (c) 2022 SEEKFREE Öð·É¿Æ¼¼
*
* ±¾ÎÄ¼þÊÇ TC377 ¿ªÔ´¿âµÄÒ»²¿·Ö
*
* TC377 ¿ªÔ´¿â ÊÇÃâ·ÑÈí¼þ
* Äú¿ÉÒÔ¸ù¾Ý×ÔÓÉÈí¼þ»ù½ð»á·¢²¼µÄ GPL£¨GNU General Public License£¬¼´ GNUÍ¨ÓÃ¹«¹²Ðí¿ÉÖ¤£©µÄÌõ¿î
* ¼´ GPL µÄµÚ3°æ£¨¼´ GPL3.0£©»ò£¨ÄúÑ¡ÔñµÄ£©ÈÎºÎºóÀ´µÄ°æ±¾£¬ÖØÐÂ·¢²¼ºÍ/»òÐÞ¸ÄËü
*
* ±¾¿ªÔ´¿âµÄ·¢²¼ÊÇÏ£ÍûËüÄÜ·¢»Ó×÷ÓÃ£¬µ«²¢Î´¶ÔÆä×÷ÈÎºÎµÄ±£Ö¤
* ÉõÖÁÃ»ÓÐÒþº¬µÄÊÊÏúÐÔ»òÊÊºÏÌØ¶¨ÓÃÍ¾µÄ±£Ö¤
* ¸ü¶àÏ¸½ÚÇë²Î¼û GPL
*
* ÄúÓ¦¸ÃÔÚÊÕµ½±¾¿ªÔ´¿âµÄÍ¬Ê±ÊÕµ½Ò»·Ý GPL µÄ¸±±¾
* Èç¹ûÃ»ÓÐ£¬Çë²ÎÔÄ<https://www.gnu.org/licenses/>
*
* ¶îÍâ×¢Ã÷£º
* ±¾¿ªÔ´¿âÊ¹ÓÃ GPL3.0 ¿ªÔ´Ðí¿ÉÖ¤Ð­Òé ÒÔÉÏÐí¿ÉÉêÃ÷ÎªÒëÎÄ°æ±¾
* Ðí¿ÉÉêÃ÷Ó¢ÎÄ°æÔÚ libraries/doc ÎÄ¼þ¼ÐÏÂµÄ GPL3_permission_statement.txt ÎÄ¼þÖÐ
* Ðí¿ÉÖ¤¸±±¾ÔÚ libraries ÎÄ¼þ¼ÐÏÂ ¼´¸ÃÎÄ¼þ¼ÐÏÂµÄ LICENSE ÎÄ¼þ
* »¶Ó­¸÷Î»Ê¹ÓÃ²¢´«²¥±¾³ÌÐò µ«ÐÞ¸ÄÄÚÈÝÊ±±ØÐë±£ÁôÖð·É¿Æ¼¼µÄ°æÈ¨ÉùÃ÷£¨¼´±¾ÉùÃ÷£©
*
* ÎÄ¼þÃû³Æ          zf_device_absolute_encoder
* ¹«Ë¾Ãû³Æ          ³É¶¼Öð·É¿Æ¼¼ÓÐÏÞ¹«Ë¾
* °æ±¾ÐÅÏ¢          ²é¿´ libraries/doc ÎÄ¼þ¼ÐÄÚ version ÎÄ¼þ °æ±¾ËµÃ÷
* ¿ª·¢»·¾³          ADS v1.10.2
* ÊÊÓÃÆ½Ì¨          TC377TP
* µêÆÌÁ´½Ó          https://seekfree.taobao.com/
*
* ÐÞ¸Ä¼ÇÂ¼
* ÈÕÆÚ              ×÷Õß                ±¸×¢
* 2022-11-03       pudding           first version
* 2023-04-25       pudding           Ôö¼ÓÖÐÎÄ×¢ÊÍËµÃ÷
********************************************************************************************************************/
/*********************************************************************************************************************
* ½ÓÏß¶¨Òå£º
*                   ------------------------------------
*                   Ä£¿é¹Ü½Å            µ¥Æ¬»ú¹Ü½Å
*                   SCLK               ²é¿´ zf_device_absolute_encoder.h ÖÐ ABSOLUTE_ENCODER_SCLK_PIN ºê¶¨Òå
*                   MOSI               ²é¿´ zf_device_absolute_encoder.h ÖÐ ABSOLUTE_ENCODER_MOSI_PIN ºê¶¨Òå
*                   MISO               ²é¿´ zf_device_absolute_encoder.h ÖÐ ABSOLUTE_ENCODER_MISO_PIN ºê¶¨Òå
*                   CS                 ²é¿´ zf_device_absolute_encoder.h ÖÐ ABSOLUTE_ENCODER_CS_PIN ºê¶¨Òå
*                   VCC                3.3VµçÔ´
*                   GND                µçÔ´µØ
>>>>>>> 82b88aed84cc13edbe61c5ab32284ccfbdcd9e9e
*                   ------------------------------------
********************************************************************************************************************/

#ifndef _zf_device_absolute_encoder_h_
#define _zf_device_absolute_encoder_h_

#include "zf_common_typedef.h"

<<<<<<< HEAD
//=================================================ï¿½ï¿½ï¿½ï¿½ ï¿½Ç¶È´ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½================================================
#define ABSOLUTE_ENCODER_USE_SOFT_SPI       (1)                                 // Ä¬ï¿½ï¿½Ê¹ï¿½ï¿½Ó²ï¿½ï¿½ SPI ï¿½ï¿½Ê½ï¿½ï¿½ï¿½ï¿½
#if ABSOLUTE_ENCODER_USE_SOFT_SPI                                               // ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½É«ï¿½ï¿½ï¿½ï¿½ï¿½Ä²ï¿½ï¿½ï¿½ï¿½ï¿½È·ï¿½ï¿½ ï¿½ï¿½É«ï¿½ÒµÄ¾ï¿½ï¿½ï¿½Ã»ï¿½ï¿½ï¿½Ãµï¿½
//====================================================ï¿½ï¿½ï¿½ï¿½ SPI ï¿½ï¿½ï¿½ï¿½====================================================
#define ABSOLUTE_ENCODER_SOFT_SPI_DELAY     (1)                                 // ï¿½ï¿½ï¿½ï¿½ SPI ï¿½ï¿½Ê±ï¿½ï¿½ï¿½ï¿½Ê±ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ÖµÔ½Ð¡ SPI Í¨ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ô½ï¿½ï¿½
#define ABSOLUTE_ENCODER_SCLK_PIN           (P20_7)                            // ï¿½ï¿½ï¿½ï¿½ SPI SCK ï¿½ï¿½ï¿½ï¿½
#define ABSOLUTE_ENCODER_MOSI_PIN           (P20_6)                            // ï¿½ï¿½ï¿½ï¿½ SPI MOSI ï¿½ï¿½ï¿½ï¿½
#define ABSOLUTE_ENCODER_MISO_PIN           (P20_5)                            // ï¿½ï¿½ï¿½ï¿½ SPI MISO ï¿½ï¿½ï¿½ï¿½
//====================================================ï¿½ï¿½ï¿½ï¿½ SPI ï¿½ï¿½ï¿½ï¿½====================================================
#else
//====================================================Ó²ï¿½ï¿½ SPI ï¿½ï¿½ï¿½ï¿½====================================================
#define ABSOLUTE_ENCODER_SPI_SPEED          (10*1000*1000)                      // Ó²ï¿½ï¿½ SPI ï¿½ï¿½ï¿½ï¿½
#define ABSOLUTE_ENCODER_SPI                (SPI_0)                             // Ó²ï¿½ï¿½ SPI ï¿½ï¿½
#define ABSOLUTE_ENCODER_SCLK_PIN           (SPI0_SCLK_P20_11)                  // Ó²ï¿½ï¿½ SPI SCK ï¿½ï¿½ï¿½ï¿½
#define ABSOLUTE_ENCODER_MOSI_PIN           (SPI0_MOSI_P20_14)                  // Ó²ï¿½ï¿½ SPI MOSI ï¿½ï¿½ï¿½ï¿½
#define ABSOLUTE_ENCODER_MISO_PIN           (SPI0_MISO_P20_12)                  // Ó²ï¿½ï¿½ SPI MISO ï¿½ï¿½ï¿½ï¿½
//====================================================Ó²ï¿½ï¿½ SPI ï¿½ï¿½ï¿½ï¿½====================================================
#endif

#define ABSOLUTE_ENCODER_CS_PIN             (P20_4)                            // CSï¿½ï¿½ï¿½Å¶ï¿½ï¿½ï¿½
#define ABSOLUTE_ENCODER_CSN(x)             ((x) ? (gpio_high(ABSOLUTE_ENCODER_CS_PIN)): (gpio_low(ABSOLUTE_ENCODER_CS_PIN)))

#define ABSOLUTE_ENCODER_TIMEOUT_COUNT      (100)                               // ï¿½Ô¼ì³¬Ê±Ê±ï¿½ï¿½
=======
//=================================================¶¨Òå ½Ç¶È´«¸ÐÆ÷ »ù±¾ÅäÖÃ================================================
#define ABSOLUTE_ENCODER_USE_SOFT_SPI       (0)                                 // Ä¬ÈÏÊ¹ÓÃÓ²¼þ SPI ·½Ê½Çý¶¯
#if ABSOLUTE_ENCODER_USE_SOFT_SPI                                               // ÕâÁ½¶Î ÑÕÉ«Õý³£µÄ²ÅÊÇÕýÈ·µÄ ÑÕÉ«»ÒµÄ¾ÍÊÇÃ»ÓÐÓÃµÄ
//====================================================Èí¼þ SPI Çý¶¯====================================================
#define ABSOLUTE_ENCODER_SOFT_SPI_DELAY     (1)                                 // Èí¼þ SPI µÄÊ±ÖÓÑÓÊ±ÖÜÆÚ ÊýÖµÔ½Ð¡ SPI Í¨ÐÅËÙÂÊÔ½¿ì
#define ABSOLUTE_ENCODER_SCLK_PIN           (P20_11)                            // Èí¼þ SPI SCK Òý½Å
#define ABSOLUTE_ENCODER_MOSI_PIN           (P20_14)                            // Èí¼þ SPI MOSI Òý½Å
#define ABSOLUTE_ENCODER_MISO_PIN           (P20_12)                            // Èí¼þ SPI MISO Òý½Å
//====================================================Èí¼þ SPI Çý¶¯====================================================
#else
//====================================================Ó²¼þ SPI Çý¶¯====================================================
#define ABSOLUTE_ENCODER_SPI_SPEED          (10*1000*1000)                      // Ó²¼þ SPI ËÙÂÊ
#define ABSOLUTE_ENCODER_SPI                (SPI_0)                             // Ó²¼þ SPI ºÅ
#define ABSOLUTE_ENCODER_SCLK_PIN           (SPI0_SCLK_P20_11)                  // Ó²¼þ SPI SCK Òý½Å
#define ABSOLUTE_ENCODER_MOSI_PIN           (SPI0_MOSI_P20_14)                  // Ó²¼þ SPI MOSI Òý½Å
#define ABSOLUTE_ENCODER_MISO_PIN           (SPI0_MISO_P20_12)                  // Ó²¼þ SPI MISO Òý½Å
//====================================================Ó²¼þ SPI Çý¶¯====================================================
#endif

#define ABSOLUTE_ENCODER_CS_PIN             (P20_13)                            // CSÒý½Å¶¨Òå
#define ABSOLUTE_ENCODER_CSN(x)             ((x) ? (gpio_high(ABSOLUTE_ENCODER_CS_PIN)): (gpio_low(ABSOLUTE_ENCODER_CS_PIN)))

#define ABSOLUTE_ENCODER_TIMEOUT_COUNT      (100)                               // ×Ô¼ì³¬Ê±Ê±¼ä
>>>>>>> 82b88aed84cc13edbe61c5ab32284ccfbdcd9e9e
#define ABSOLUTE_ENCODER_DEFAULT_ZERO       (0)

#define ABSOLUTE_ENCODER_SPI_W              (0x80)
#define ABSOLUTE_ENCODER_SPI_R              (0x40)

#define ABSOLUTE_ENCODER_ZERO_L_REG         (0x00)
#define ABSOLUTE_ENCODER_ZERO_H_REG         (0x01)
#define ABSOLUTE_ENCODER_DIR_REG            (0X09)
<<<<<<< HEAD
//=================================================ï¿½ï¿½ï¿½ï¿½ ï¿½Ç¶È´ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½================================================


//=================================================ï¿½ï¿½ï¿½ï¿½ ï¿½Ç¶È´ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½================================================
int16   absolute_encoder_get_location       (void);                             // ï¿½ï¿½ï¿½ï¿½Öµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È¡ï¿½ï¿½Ç°ï¿½Ç¶ï¿½Öµ
int16   absolute_encoder_get_offset         (void);                             // ï¿½ï¿½ï¿½ï¿½Öµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È¡ï¿½ï¿½ï¿½ï¿½Ï´ï¿½Î»ï¿½Ãµï¿½Æ«ï¿½ï¿½Öµ
uint8   absolute_encoder_init               (void);                             // ï¿½ï¿½ï¿½ï¿½Öµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê¼ï¿½ï¿½
//=================================================ï¿½ï¿½ï¿½ï¿½ ï¿½Ç¶È´ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½================================================
=======
//=================================================¶¨Òå ½Ç¶È´«¸ÐÆ÷ »ù±¾ÅäÖÃ================================================


//=================================================ÉùÃ÷ ½Ç¶È´«¸ÐÆ÷ »ù´¡º¯Êý================================================
int16   absolute_encoder_get_location       (void);                             // ¾ø¶ÔÖµ±àÂëÆ÷»ñÈ¡µ±Ç°½Ç¶ÈÖµ
int16   absolute_encoder_get_offset         (void);                             // ¾ø¶ÔÖµ±àÂëÆ÷»ñÈ¡Ïà½ÏÉÏ´ÎÎ»ÖÃµÄÆ«ÒÆÖµ
uint8   absolute_encoder_init               (void);                             // ¾ø¶ÔÖµ±àÂëÆ÷³õÊ¼»¯
//=================================================ÉùÃ÷ ½Ç¶È´«¸ÐÆ÷ »ù´¡º¯Êý================================================
>>>>>>> 82b88aed84cc13edbe61c5ab32284ccfbdcd9e9e
#endif

